app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "image_file_name" = ?, "updated_at" = ? WHERE "projects"."id" = 4  [["image_file_name", "project-a.jpg"], ["updated_at", Sat, 25 Jan 2014 03:04:40 UTC +00:00]]
---
  def update
    @project = Project.find(params[:id])
    @project.update(project_params)

INSERT INTO "projects" ("created_at", "description", "image_file_name", "name", "pledging_ends_on", "target_pledge_amount", "team_members", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)
    @project.save